Fix ADR - include diagrams and fix incorect information
